# St7GetLastSaveFileCode

Returns the error code generated by the last call to St7SaveFile, St7SaveFileCopy, St7SaveDeformedCopy,
St7SaveViewOnlyCopy, St7SaveSubModel or St7SaveBeamSectionMesh.

long St7GetLastSaveFileCode()

The function returns a long integer packed with logical bit flags at the following addresses:

[ibFileNameTooLongOrInvalid] – File name is too long or contains invalid characters.

[ibFileSharingError] – File is locked by another process.

[ibFileCantWrite] – File could not be written.

[ibInsufficientFreeSpace] – Insufficient free space to save the file.

[ibFileReadOnly] – The file is a read-only file.